src/DataProcessors/ОбменЭлектроннымиДокументамиСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>ОбменЭлектроннымиДокументамиСБанком</Name>
			<Comment>Обмен электронными документами с банком</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выписки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетОрганизации</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыпискаБанка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СостоянияЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеВерсииЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВерсийЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействияСНашейСтороны</Name>
					<Comment>Признак необходимости выполнения какого-либо действия с ЭД с нашей стороны</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СводныеСостоянияЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействияСоСтороныДругогоУчастника</Name>
					<Comment>Признак ожидания выполнения какого-либо действия со стороны другого участника ЭД</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СводныеСостоянияЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизвольныйЭД</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПакетЭД</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>ВидыЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимостиОтправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12Продавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПрограммыБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>ПрограммыБанка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АльфаБанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбербанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезДопОбработку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СостоянияВерсийЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>СостоянияВерсийЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытПринудительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеНаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПолучен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЗавершенСИсправлением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИзвещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИсполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяКорректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтправкаИзвещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтправкаПолучателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПередачаОператору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждениеОператора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяАннулировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяУточнитьДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ОбменЭлектроннымиДокументамиСБанком/Forms/ФормаОбработки/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяОбменЭДСБанками = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьЗначениеФункциональнойОпции(
																				"ИспользоватьОбменЭДСБанками");
	Если НЕ ИспользуетсяОбменЭДСБанками Тогда
		ТекстСообщения = ЭлектронныеДокументыСлужебныйВызовСервера.ТекстСообщенияОНеобходимостиНастройкиСистемы(
																				"РаботаСБанками");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
	Элементы.СтраницыВидыБанковскихСистем.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если Не ПустаяСтрока(Параметры.ОткрытьСтраницу) Тогда
		Элементы.СтраницыОтправкаПолучение.ТекущаяСтраница = Элементы[Параметры.ОткрытьСтраницу];
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПараметры();
	ЗаполнитьТабличныеЧасти();
	ПереключитьСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Элементы.Выписки.Обновить();
	Если Элементы.СтраницыВидыБанковскихСистем.ТекущаяСтраница = Элементы.СтраницаСбербанк Тогда
		Элементы.ПлатежныеПорученияВОбработке.Обновить();
		ОбновитьЭлектронныеДокументыНаОтправку(Объект.СоглашениеЭД, ПлатежныеПорученияКОтправке);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СоглашениеЭДПриИзменении(Элемент)
	
	ЗаполнитьПараметры();
	Модифицированность = Ложь;
	ПереключитьСтраницы();
	ЗаполнитьТабличныеЧасти()
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Модифицированность = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗапроситьВыписку(Команда)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		СообщениеТекст = Нстр("ru = 'Необходимо выбрать период запроса'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, , "Период");
		Возврат;
	КонецЕсли;
	
	ДатаОкончания = Период.ДатаОкончания;
	
	ТекущаяДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если Период.ДатаНачала > ТекущаяДатаСеанса ИЛИ ДатаОкончания > КонецДня(ТекущаяДатаСеанса) Тогда
		СообщениеТекст = Нстр("ru = 'Период запроса указан неверно'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, , "Период");
		Возврат;
	КонецЕсли;
	
	Если ДатаОкончания = КонецДня(ТекущаяДатаСеанса) Тогда
		ДатаОкончания = ТекущаяДатаСеанса;
	КонецЕсли;
	
	ЭлектронныеДокументыКлиент.ПолучитьВыпискуБанка(
		Объект.СоглашениеЭД, Период.ДатаНачала, ДатаОкончания, Элементы.Выписки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСвязи(Команда)
	
	ЭлектронныеДокументыСлужебныйКлиент.ПроверитьНаличиеСвязиСБанком(Объект.СоглашениеЭД, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыделенные(Команда)
		
	МассивСтрок = Элементы.ПлатежныеПорученияКОтправке.ВыделенныеСтроки;
	Для Каждого НомерСтроки Из МассивСтрок Цикл
		СтрокаТаблицы = ПлатежныеПорученияКОтправке.НайтиПоИдентификатору(НомерСтроки);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.Выгружать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсехСтрок(Команда)
	
	Для Каждого ТекДокумент Из ПлатежныеПорученияКОтправке Цикл
		Если ТекДокумент.Выгружать Тогда
			ТекДокумент.Выгружать = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтмеченные(Команда)

	МассивОтправки = Новый Массив();
	Для каждого строка из ПлатежныеПорученияКОтправке Цикл
		Если Строка.Выгружать Тогда
			МассивОтправки.Добавить(Строка.ЭлектронныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	КолОтправленных = 0;
	Если МассивОтправки.Количество() > 0 Тогда
		ЭлектронныеДокументыСлужебныйКлиент.ОтправитьПлатежныеПорученияСбербанк(МассивОтправки,
																				КолОтправленных,
																				Объект.СоглашениеЭД);
	КонецЕсли;
	ЗаголовокОповещения = НСтр("ru = 'Обмен электронными документами'");
	
	Если КолОтправленных > 0 Тогда
		ТекстОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
															НСтр("ru = 'Отправлено документов: (%1)'"),
															КолОтправленных);
		ПлатежноеПоручение = ПредопределенноеЗначение("Перечисление.ВидыЭД.ПлатежноеПоручение");
		ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(Объект.СоглашениеЭД, ПлатежноеПоручение);
		
	Иначе
		ТекстОповещения = НСтр("ru = 'Отправленных пакетов нет'");
	КонецЕсли;
	
	Оповестить("ОбновитьСостояниеЭД");
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения, , ТекстОповещения);
	
	ОбновитьЭлектронныеДокументыНаОтправку(Объект.СоглашениеЭД, ПлатежныеПорученияКОтправке);
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьЭлектронныеДокументыНаОтправку(Объект.СоглашениеЭД, ПлатежныеПорученияКОтправке);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВыписку(Команда)
	
	КаналСоздан = ложь;
	ЭлектронныеДокументыСлужебныйКлиент.УстановитьВиртуальныйКанал(Объект.СоглашениеЭД, КаналСоздан);
	Если НЕ КаналСоздан Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументыСлужебныйКлиент.ОтправитьЗапросНаНочныеВыписки(Объект.СоглашениеЭД);
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ЗапросВыписки"));
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ВыпискаБанка"));
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ЗапросНочнойВыписки"));
	ЭлектронныеДокументыСлужебныйКлиент.ОтправитьЗапросНаПолучениеГотовыхВыписок(Объект.СоглашениеЭД);
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ВыпискаБанка"));
	Элементы.ВыпискаБанкаСбербанк.Обновить();
	
	ПоследнийЭД = ПоследнийЭД(Объект.СоглашениеЭД);
	
	Если ЗначениеЗаполнено(ПоследнийЭД) ТОгда
		Элементы.ВыпискаБанкаСбербанк.ТекущаяСтрока = ПоследнийЭД;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПолучитьСтатусы(Команда)
	
	КаналСоздан = Ложь;
	ЭлектронныеДокументыСлужебныйКлиент.УстановитьВиртуальныйКанал(Объект.СоглашениеЭД, КаналСоздан);
	Если НЕ КаналСоздан Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежноеПоручение = ПредопределенноеЗначение("Перечисление.ВидыЭД.ПлатежноеПоручение");
	
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(Объект.СоглашениеЭД,    ПлатежноеПоручение);
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьСостоянияЭлектронныхДокументов(Объект.СоглашениеЭД, ПлатежноеПоручение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьВыпискуСбербанк(Команда)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		СообщениеТекст = НСтр("ru = 'Необходимо выбрать период запроса'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, , "Период");
		Возврат;
	КонецЕсли;
		
	Если Период.ДатаНачала > Период.ДатаОкончания Тогда
		ТекстСообщения = НСтр("ru = 'Дата начала периода должна быть меньше даты окончания'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, , "Период");
		Возврат;
	КонецЕсли;
	
	ЭД = Неопределено;
	
	ЭлектронныеДокументыСлужебныйКлиент.ЗапроситьВыпискуСбербанк(
												Объект.СоглашениеЭД,
												Объект.Организация,
												Период.ДатаНачала,
												Период.ДатаОкончания,
												,
												ЭД);
	
	Элементы.ВыпискаБанкаСбербанк.Обновить();
	
	Если ЗначениеЗаполнено(ЭД) ТОгда
		Элементы.ВыпискаБанкаСбербанк.ТекущаяСтрока = ЭД;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ВыборСтандартногоПериода(ПериодОтбора);
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ВыпискаБанкаСбербанк.Отбор, "ДатаСоздания");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ВыпискаБанкаСбербанк.Отбор,
			"ДатаСоздания",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
			ПериодОтбора.ДатаНачала,
			,
			ЗначениеЗаполнено(ПериодОтбора.ДатаНачала));
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ВыпискаБанкаСбербанк.Отбор,
			"ДатаСоздания",
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
			КонецДня(ПериодОтбора.ДатаОкончания),
			,
			ЗначениеЗаполнено(ПериодОтбора.ДатаОкончания));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ВЫПИСКИ>

&НаКлиенте
Процедура ВыпискиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Элементы.Выписки.ТекущаяСтрока = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыборСтандартногоПериода(Период)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Если Диалог.Редактировать() Тогда
		Период = Диалог.Период;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницы()
	
	Если ЗначениеЗаполнено(Объект.СоглашениеЭД) Тогда
		ПрограммаБанка =  ПрограммаБанка(Объект.СоглашениеЭД);
		Если ПрограммаБанка = ПредопределенноеЗначение("Перечисление.ПрограммыБанка.СбербанкОнлайн") Тогда
			Элементы.СтраницыВидыБанковскихСистем.ТекущаяСтраница = Элементы.СтраницаСбербанк;
			
			#Если НЕ (ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение) Тогда
				
				Элементы.СтраницыОтправкаПолучение.ТекущаяСтраница    = Элементы.Ошибка;
				Элементы.Ошибка.Видимость                             = Истина;
				Элементы.СтраницыОтправкаПолучение.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
				
			#КонецЕсли
			
		Иначе
			Элементы.СтраницыВидыБанковскихСистем.ТекущаяСтраница = Элементы.СтраницаТиповой;
		КонецЕсли;
	Иначе
		Элементы.СтраницыВидыБанковскихСистем.ТекущаяСтраница = Элементы.СтраницаТиповой;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры()
	
	Если ЗначениеЗаполнено(Объект.СоглашениеЭД) Тогда
		РеквизитыСоглашения = РеквизитыСоглашения(Объект.СоглашениеЭД);
		Объект.Банк         = РеквизитыСоглашения.Контрагент;
		Объект.Организация  = РеквизитыСоглашения.Организация;
		ПрограммаБанка      = РеквизитыСоглашения.ПрограммаБанка;
	Иначе
		Объект.Банк        = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		ПрограммаБанка     = ПредопределенноеЗначение("Перечисление.ПрограммыБанка.ПустаяСсылка");
	КонецЕсли;
	
	ВыпискиБанка.Параметры.УстановитьЗначениеПараметра("СоглашениеЭД", Объект.СоглашениеЭД);
	ВыпискаБанкаСбербанк.Параметры.УстановитьЗначениеПараметра("СоглашениеЭД", Объект.СоглашениеЭД);
	ПлатежныеПорученияВОбработке.Параметры.УстановитьЗначениеПараметра("СоглашениеЭД", Объект.СоглашениеЭД);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрограммаБанка(СоглашениеЭД)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СоглашениеЭД, "ПрограммаБанка");
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыСоглашения(СоглашениеЭД)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СоглашениеЭД, "Организация, Контрагент, ПрограммаБанка");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьЭлектронныеДокументыНаОтправку(Знач СоглашениеЭД, ПлатежныеПорученияКОтправке)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияЭД.СсылкаНаОбъект.Контрагент КАК Получатель,
	               |	СостоянияЭД.СсылкаНаОбъект.Номер КАК Номер,
	               |	СостоянияЭД.СсылкаНаОбъект.Дата КАК Дата,
	               |	СостоянияЭД.СсылкаНаОбъект.СуммаДокумента КАК СуммаДокумента,
	               |	СостоянияЭД.СсылкаНаОбъект.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	СостоянияЭД.СсылкаНаОбъект.СчетКонтрагента КАК СчетПолучателя,
	               |	СостоянияЭД.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	               |	СостоянияЭД.СсылкаНаОбъект.СчетОрганизации КАК СчетОрганизации
	               |ИЗ
	               |	РегистрСведений.СостоянияЭД КАК СостоянияЭД
	               |ГДЕ
	               |	СостоянияЭД.СостояниеВерсииЭД = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяОтправка)
	               |	И СостоянияЭД.ЭлектронныйДокумент.СоглашениеЭД = &СоглашениеЭД
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	Запрос.УстановитьПараметр("СоглашениеЭД", СоглашениеЭД);
	ПлатежныеПорученияКОтправке.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличныеЧасти()
	
	Если Элементы.СтраницыВидыБанковскихСистем.ТекущаяСтраница = Элементы.СтраницаСбербанк Тогда
		ОбновитьЭлектронныеДокументыНаОтправку(Объект.СоглашениеЭД, ПлатежныеПорученияКОтправке);
	КонецЕсли;
	УстановитьДоступностьЭлементов();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()

	Элементы.СтраницыВидыБанковскихСистем.Доступность = ЗначениеЗаполнено(Объект.СоглашениеЭД);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоследнийЭД(СоглашениеЭД)
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭДПрисоединенныеФайлы.Ссылка КАК ЭлектронныйДокумент
	|ИЗ
	|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|ГДЕ
	|	ЭДПрисоединенныеФайлы.СоглашениеЭД = &СоглашениеЭД
	|	И (ЭДПрисоединенныеФайлы.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.ЗапросВыписки)
	|			ИЛИ ЭДПрисоединенныеФайлы.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.ВыпискаБанка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания УБЫВ";
	Запрос.УстановитьПараметр("СоглашениеЭД", СоглашениеЭД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭлектронныйДокумент;
	КонецЕсли
	
КонецФункции
